Revit 2027 API
Application.NewXYZ(XYZ) Method
Creates a XYZ object by copying the supplied XYZ object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ NewXYZ(
	XYZ xyz
)
Public Function NewXYZ (
	xyz As XYZ
) As XYZ
public:
XYZ^ NewXYZ(
	XYZ^ xyz
)
member NewXYZ :
        xyz : XYZ -> XYZ
Parameters
xyz XYZ
The supplied XYZ object
Return Value
XYZ
See Also
Reference
Application Class
NewXYZ Overload
Autodesk.Revit.Creation Namespace